bench/results/java11/20260309T225917Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 6879.04, "p50": "3.29ms", "p95": "6.33ms", "p99": "7.49ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.49ms    1.35ms 116.86ms   74.33%\n    Req/Sec     1.73k   157.36     2.14k    77.38%\n  Latency Distribution\n     50%    3.29ms\n     75%    4.17ms\n     90%    5.16ms\n     99%    7.49ms\n  825679 requests in 2.00m, 188.20MB read\nRequests/sec:   6879.04\nTransfer/sec:      1.57MB"}